solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/boards/mimxrt700evk/edgefast_bluetooth_examples/unicast_media_sender/cm33_core0/unicast_media_sender.c
/* set conn interval to 30ms and timeout to 300ms. */
static struct bt_le_conn_param conn_param = {
	.interval_min = 24,
	.interval_max = 24,
	.latency = 0,
	.timeout = 30,
};

static OSA_SEMAPHORE_HANDLE_DEFINE(sem_wav_opened);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_lc3_preset);
OSA_SEMAPHORE_HANDLE_DEFINE(sem_scan);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_device_selected);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_connected);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_csip_discovered);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_member_discovered);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_disconnected);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_mtu_exchanged);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_security_updated);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_sinks_discovered);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_vcs_discovered);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_sources_discovered);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_stream_configured);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_stream_qos);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_stream_enabled);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_stream_disabled);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_stream_started);
static OSA_SEMAPHORE_HANDLE_DEFINE(sem_stream_connected);

static bool cis_stream_play = true;
static bool cis_stream_play_update = false;

static uint32_t seq_num = 0;
static uint64_t tx_samples = 0;
static uint32_t tx_time_stamp_start;

static uint32_t get_cig_sync_delay(void)
{
	struct bt_iso_info iso_info;

	bt_iso_chan_get_info(&streams[0].ep->iso->chan, &iso_info);

	return iso_info.unicast.cig_sync_delay;
}

static uint32_t get_iso_interval(void)
{
	struct bt_iso_info iso_info;
	uint32_t ISO_Interval_us;

	bt_iso_chan_get_info(&streams[0].ep->iso->chan, &iso_info);

	ISO_Interval_us = iso_info.iso_interval * 1250;

	return ISO_Interval_us;
}

static uint32_t get_sync_signal_timestamp(void)
{
	uint32_t time_stamp;

	time_stamp = BOARD_SyncSignal_Count() * get_iso_interval() + get_cig_sync_delay();

	return time_stamp;
}

static uint16_t get_and_incr_seq_num(const struct bt_bap_stream *stream)
{
	for (size_t i = 0U; i < CONFIG_BT_MAX_CONN; i++) {
		if (stream->ep == sinks[i].ep) {
			return sinks[i].seq_num++;
		}
	}

	PRINTF("Could not find endpoint from stream %p\n", stream);

	return 0;
}

#if defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
#if defined(APP_BRIDGE_UPSAMPLE_441_TO_48) && (APP_BRIDGE_UPSAMPLE_441_TO_48 > 0)
static void Resampler_Init(int instans, int sample_rate_in, int sample_rate_out, int samples_per_frame_in, int samples_per_frame_out)
{
    upSrcCfg[instans].fsIn = sample_rate_in;            //input sampling rate
    upSrcCfg[instans].sfOut = sample_rate_out;           //output sampling rate
    upSrcCfg[instans].phs = 32;                              //the filter phases
    upSrcCfg[instans].fltTaps = 32;                          //the filter taps
    upSrcCfg[instans].frmSizeIn = samples_per_frame_in;   //input frame size, 10ms interval
    upSrcCfg[instans].frmSizeOut = samples_per_frame_out;  //output frame size

    initUpCvtFrm(&upSrc[instans], &upSrcCfg[instans], 0.0);
}

static int Resampler(int instans, int16_t *in, int16_t *out)
{
    int samples_out = 0;
    /* Here we only use up convter.  */
    samples_out = upCvtFrm(&upSrc[instans], in, out);

    return samples_out;
}
#endif
#endif

static int audio_stream_encode(bool mute)
{
	uint32_t sdu_time_stamp;
	int bits;

	/* read one frame samples. */
#if defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
	if(!mute)
	{
#if defined(APP_BRIDGE_UPSAMPLE_441_TO_48) && (APP_BRIDGE_UPSAMPLE_441_TO_48 > 0)
		int ret = ring_buf_get(&a2dp_to_ums_audio_buf, wav_file_buff, 441 * 4);

		if (ret != 441 * 4)
		{
			int clear_bytes = 441 * 4 - ret;
			memset(wav_file_buff + ret, 0, clear_bytes);
		}
#else
		int ret = ring_buf_get(&a2dp_to_ums_audio_buf, wav_file_buff, lc3_codec_info.samples_per_frame * 4);

		if (ret != lc3_codec_info.samples_per_frame * 4)
		{
			int clear_bytes = lc3_codec_info.samples_per_frame * 4 - ret;
			memset(wav_file_buff + ret, 0, clear_bytes);
		}
#endif

		ring_buff_read_out_bytes += ret;

		if(a2dp_sink_audio_frame_size > 0)
		{
			for (; ring_buff_read_out_bytes >= a2dp_sink_audio_frame_size; ring_buff_read_out_bytes -= a2dp_sink_audio_frame_size)
			{
				app_audio_streamer_task_signal();
			}
		}
	}

	bits = 16;
#else
	if(!mute)
	{
		int res;

		do
		{
			res = wav_file_read_samples(&wav_file, wav_file_buff, lc3_codec_info.samples_per_frame);
			if(res == WAV_FILE_END)
			{
				if(wav_file_rewind(&wav_file))
				{
					PRINTF("\nwav_file_rewind fail!\n");
					return -1;
				}

				continue;
			}
			if(res == WAV_FILE_ERR)
			{
				PRINTF("\nwav_file_rewind fail!\n");
				return -1;
			}
		} while (res != 0);
	}

	bits = wav_file.bits;
#endif

	if(mute)
	{
#if defined(APP_BRIDGE_UPSAMPLE_441_TO_48) && (APP_BRIDGE_UPSAMPLE_441_TO_48 > 0)
		memset(wav_file_buff, 0, 441 * 2 * (bits / 8));
#else
		memset(wav_file_buff, 0, lc3_codec_info.samples_per_frame * 2 * (bits / 8));
#endif
	}

	/* copy data from pcm form to channel format */
	if(2 == lc3_codec_info.channels)
	{
#if defined(APP_BRIDGE_UPSAMPLE_441_TO_48) && (APP_BRIDGE_UPSAMPLE_441_TO_48 > 0) && \
	defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
		(void)audio_data_stereo_split(441, bits, wav_file_buff, audio_buff[0], audio_buff[1]);
		Resampler(0, (int16_t *)audio_buff[0], (int16_t *)a2dp_audio_resample_buff[0]);
		Resampler(1, (int16_t *)audio_buff[1], (int16_t *)a2dp_audio_resample_buff[1]);
		memcpy(audio_buff[0], a2dp_audio_resample_buff[0], 480 * 2);
		memcpy(audio_buff[1], a2dp_audio_resample_buff[1], 480 * 2);
#else
		(void)audio_data_stereo_split(lc3_codec_info.samples_per_frame, bits, wav_file_buff, audio_buff[0], audio_buff[1]);
#endif
	}
	else
	{
		/* Todo. */
		while(1);
	}

	/* encode every channels */
	for(int i = 0; i < lc3_codec_info.channels; i++)
	{
		int lc3_res = lc3_encoder(&encoder[i], audio_buff[i], sdu_buff[i]);
		if(lc3_res)
		{
			PRINTF("\nlc3_encoder fail!\n");
		}
	}

	struct net_buf *buf[CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT];
	for(int i = 0; i < CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT; i++)
	{
		do {
			int timeout;
			if(lc3_preset.qos.framing == BT_AUDIO_CODEC_QOS_FRAMING_FRAMED)
			{
				timeout = (lc3_codec_info.frame_duration_us * 2 + 5000) / 1000;
			}
			else
			{
				timeout = (lc3_codec_info.frame_duration_us + 5000) / 1000;
			}
			buf[i] = net_buf_alloc(tx_pool[i], timeout);
			if(buf[i] == NULL)
			{
				PRINTF("iso net buff alloc timeout!\n");
			}
		} while (buf[i] == NULL);
		net_buf_reserve(buf[i], BT_ISO_CHAN_SEND_RESERVE);
	}

	for(int i = 0; i < lc3_codec_info.channels; i++)
	{
		net_buf_add_mem(buf[i], sdu_buff[i], lc3_codec_info.octets_per_frame);
	}

	if(seq_num == 0)
	{
		tx_samples = 0;
		tx_time_stamp_start = get_sync_signal_timestamp() + get_iso_interval();
		sdu_time_stamp = tx_time_stamp_start;
	}
	else
	{
		tx_samples += lc3_codec_info.samples_per_frame;
		sdu_time_stamp = (uint32_t)((double)tx_time_stamp_start + (double)tx_samples * 1000000.0 / (double)lc3_codec_info.sample_rate);
	}

	for(int i = 0; i < CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT; i++)
	{
		struct bt_bap_stream *stream = NULL;
		enum bt_audio_location loc = (i == 0) ? BT_AUDIO_LOCATION_FRONT_LEFT : BT_AUDIO_LOCATION_FRONT_RIGHT;

