solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/boards/mimxrt700evk/edgefast_bluetooth_examples/unicast_media_sender/cm33_core0/unicast_media_sender.c
		/* find the left/right audio channel stream before send. */
		for (int index = 0; index < LE_CONN_COUNT; index++)
		{
			if(audio_receiver_loc[index] & loc)
			{
				stream = &streams[index];
				break;
			}
		}

		if(stream_disconnected[i])
		{
			net_buf_unref(buf[i]);
		}
		else
		{
			int ret = bt_bap_stream_send_ts(stream, buf[i],
								get_and_incr_seq_num(stream),
								sdu_time_stamp);
			if (ret < 0) {
				/* This will end send stream. */
				PRINTF("Unable to send stream on %p: %d\n", stream, ret);
				net_buf_unref(buf[i]);
				if(ret == -ENOTCONN)
				{
					stream_disconnected[i] = true;
				}
			}
		}

		/* return err if both stream disconnected. */
		if(stream_disconnected[0] && stream_disconnected[1])
		{
			return -1;
		}
	}

	seq_num += 1;

	return 0;
}

static void wav_file_list(const char *path)
{
	DIR dir;
	FRESULT res;
	FILINFO info;
	char fname[FF_LFN_BUF + 1];
	int i = 0;

	PRINTF("\nwav file list:\n");

	res = f_findfirst(&dir, &info, path, "*.wav");
	while((res == FR_OK) && (info.fname[0]))
	{
		i++;
		memset(fname, 0, sizeof(fname));
		strcat(fname, path);
		strcat(fname, info.fname);
		PRINTF("%d, %s\n", i, fname);
		res = f_findnext(&dir, &info);
	}

	PRINTF("wav file list complete!\n");
}

int open_wav_file(char *path)
{
	int res;

	res = wav_file_open(&wav_file, path);
	if(res)
	{
		PRINTF("\nwav_file_open fail!\n");
		return -1;
	}

	PRINTF("wav file info:\n");
	PRINTF("\tsample_rate: %d\n", 	wav_file.sample_rate);
	PRINTF("\tchannels: %d\n", 		wav_file.channels);
	PRINTF("\tbits: %d\n", 			wav_file.bits);
	PRINTF("\tsize: %d\n", 			wav_file.size);
	PRINTF("\tsamples: %d\n", 		wav_file.samples);

	switch (wav_file.sample_rate)
	{
		case 8000: break;
		case 16000: break;
		case 24000: break;
		case 32000: break;
		case 44100: break;
		case 48000: break;
		default:
			PRINTF("\nwav file sample rate %d not support!\n", wav_file.sample_rate);
			return -1;
	}

	if(wav_file.channels != 2)
	{
		PRINTF("\nwav file not 2 channels!\n");
		return -1;
	}

	if((wav_file.bits != 16) && (wav_file.bits != 24) && (wav_file.bits != 32))
	{
		PRINTF("\nwav file %d bits not support!\n", wav_file.bits);
		return -1;
	}

	(void)OSA_SemaphorePost(sem_wav_opened);

	return 0;
}

static void close_wav_file(void)
{
	int res = wav_file_close(&wav_file);
	if(res)
	{
		PRINTF("\nwav_file_close fail!\n");
	}
}

static void print_lc3_preset(const char *name, const struct bt_bap_lc3_preset *preset)
{
	const struct bt_audio_codec_cfg *codec_cfg = &preset->codec_cfg;
	const struct bt_audio_codec_qos *qos = &preset->qos;

	PRINTF("%s:\n", name);

	PRINTF("\tcodec_cfg - sample_rate: %d, duration: %d, len: %d\n",
			bt_audio_codec_cfg_freq_to_freq_hz((enum bt_audio_codec_cfg_freq)bt_audio_codec_cfg_get_freq(codec_cfg)),
			bt_audio_codec_cfg_frame_dur_to_frame_dur_us((enum bt_audio_codec_cfg_frame_dur)bt_audio_codec_cfg_get_frame_dur(codec_cfg)),
			bt_audio_codec_cfg_get_octets_per_frame(codec_cfg)
		);

	PRINTF("\tqos - interval: %d, framing: %d, phy: %d, sdu: %d, rtn: %d, pd: %d\n",
			qos->interval,
			qos->framing,
			qos->phy,
			qos->sdu,
			qos->rtn,
			qos->pd
		);
}

void print_all_preset(int sample_rate)
{
	PRINTF("\nlc3 preset list:\n");
	for(int i = 0; i < ARRAY_SIZE(lc3_unicast_presets); i++)
	{
		if(sample_rate != 0)
		{
			const struct bt_audio_codec_cfg *codec_cfg = &lc3_unicast_presets[i].preset.codec_cfg;
			int codec_sample_rate = bt_audio_codec_cfg_freq_to_freq_hz((enum bt_audio_codec_cfg_freq)bt_audio_codec_cfg_get_freq(codec_cfg));
			if(codec_sample_rate != sample_rate)
			{
				continue;
			}
		}
		print_lc3_preset(lc3_unicast_presets[i].name, &lc3_unicast_presets[i].preset);
	}
}

int select_lc3_preset(char *preset_name)
{
	bool find = false;

	for(int i = 0; i < ARRAY_SIZE(lc3_unicast_presets); i++)
	{
		const struct bt_audio_codec_cfg *codec_cfg = &lc3_unicast_presets[i].preset.codec_cfg;

		if(0 == strcmp(lc3_unicast_presets[i].name, preset_name))
		{
			int sample_rate = bt_audio_codec_cfg_freq_to_freq_hz((enum bt_audio_codec_cfg_freq)bt_audio_codec_cfg_get_freq(codec_cfg));
#if defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
#if defined(APP_BRIDGE_UPSAMPLE_441_TO_48) && (APP_BRIDGE_UPSAMPLE_441_TO_48 > 0)
			if(sample_rate != 48000)
#else
			if(sample_rate != a2dp_audio_sample_rate)
#endif
#else
			if(sample_rate != wav_file.sample_rate)
#endif
			{
				PRINTF("preset sample rate %d not align with wav %d\n", sample_rate, wav_file.sample_rate);
				return -1;
			}
			find = true;
			memcpy(&lc3_preset, &lc3_unicast_presets[i].preset, sizeof(lc3_preset));
		}
	}

	if(!find)
	{
		return -1;
	}

	print_lc3_preset(preset_name, &lc3_preset);

#if defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
	if((a2dp_audio_sample_rate == 44100) || (a2dp_audio_sample_rate == 48000))
	{
		lc3_preset.qos.rtn = 1;
	}

	print_lc3_preset("a2dp_bridge_limit_rtn=1", &lc3_preset);
#endif

	(void)OSA_SemaphorePost(sem_lc3_preset);

	return 0;
}

int modify_rtn(int rtn)
{
	if(!IN_RANGE(rtn, 0, 255))
	{
		return -1;
	}

	new_rtn = rtn;

	return 0;
}

int modify_pd(int pd)
{
	if(!IN_RANGE(pd, 10000, 70000))
	{
		return -1;
	}

	new_pd = pd;

	return 0;
}

int modify_phy(int phy)
{
	/* 1: 1M, 2: 2M, 4: Coded. */
	if((phy == BT_AUDIO_CODEC_QOS_1M) || (phy == BT_AUDIO_CODEC_QOS_2M) || (phy == BT_AUDIO_CODEC_QOS_CODED))
	{
		new_phy = phy;
		return 0;
	}

	return -1;
}

int modify_packing(int packing)
{
	/* 0: sequentially, 1: interleaved. */
	if((packing == BT_ISO_PACKING_SEQUENTIAL) || (packing == BT_ISO_PACKING_INTERLEAVED))
	{
		iso_packing = packing;
		return 0;
	}

	return -1;
}

void print_sync_info(void)
{
	uint32_t iso_interval = get_iso_interval();
	uint32_t sync_delay = get_cig_sync_delay();

	PRINTF("sync info - iso_interval: %u, sync_delay: %u\n", iso_interval, sync_delay);
}

int modify_conn_param(int interval_min, int interval_max, int latency, int timeout)
{
	if(!IN_RANGE(interval_min, 0x0006, 0x0C80))
	{
		return -1;
	}

