solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/boards/mimxrt700evk/edgefast_bluetooth_examples/unicast_media_sender/cm33_core0/unicast_media_sender.c
	if(!IN_RANGE(interval_max, 0x0006, 0x0C80))
	{
		return -1;
	}

	if(!IN_RANGE(latency, 0x0000, 0x01F3))
	{
		return -1;
	}

	if(!IN_RANGE(timeout, 0x000A, 0x0C80))
	{
		return -1;
	}

	conn_param.interval_min = interval_min;
	conn_param.interval_max = interval_max;
	conn_param.latency = latency;
	conn_param.timeout = timeout;

	return 0;
}

void config_audio_parameters(int sample_rate, int channels, int bits)
{
	/* set the LC3 encoder parameters. */
	lc3_codec_info.sample_rate = sample_rate;
	lc3_codec_info.frame_duration_us = bt_audio_codec_cfg_frame_dur_to_frame_dur_us((enum bt_audio_codec_cfg_frame_dur)bt_audio_codec_cfg_get_frame_dur(&lc3_preset.codec_cfg));
	lc3_codec_info.octets_per_frame = bt_audio_codec_cfg_get_octets_per_frame(&lc3_preset.codec_cfg);
	lc3_codec_info.blocks_per_sdu = 1;
	lc3_codec_info.chan_allocation = 0; /* not used. */

	lc3_codec_info.channels = channels;
	if(lc3_codec_info.sample_rate == 44100)
	{
		if(lc3_codec_info.frame_duration_us == 7500)
		{
			lc3_codec_info.samples_per_frame = 360;
		}
		else
		{
			lc3_codec_info.samples_per_frame = 480;
		}
	}
	else
	{
		lc3_codec_info.samples_per_frame = lc3_codec_info.sample_rate * (lc3_codec_info.frame_duration_us / 100) / 10000;
	}
	lc3_codec_info.bytes_per_channel_frame = lc3_codec_info.samples_per_frame * bits / 8;

	/* LC3 Encoder Init. */
	for (int i = 0; i < lc3_codec_info.channels; i++)
	{
		int lc3_res = lc3_encoder_init(&encoder[i], sample_rate, lc3_codec_info.frame_duration_us, lc3_codec_info.octets_per_frame, bits);
		if(lc3_res)
		{
			PRINTF("\nlc3_encoder_init fail!\n");
		}
	}
	PRINTF("LC3 encoder setup done!\n");

#if defined(APP_BRIDGE_UPSAMPLE_441_TO_48) && (APP_BRIDGE_UPSAMPLE_441_TO_48 > 0) && \
	defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
	/* Resampler Init. */
	if(lc3_codec_info.frame_duration_us == 7500)
	{
		PRINTF("\nbridge upsample not support 7.5ms frame!\n");
		while(1);
	}
	Resampler_Init(0, 44100, 48000, 441, 480);
	Resampler_Init(1, 44100, 48000, 441, 480);
#endif

	/* set codec data. */

	/* set codec qos. */
}

static void print_hex(const uint8_t *ptr, size_t len)
{
	while (len-- != 0) {
		PRINTF("%02x", *ptr++);
	}
}

static bool print_cb(struct bt_data *data, void *user_data)
{
	const char *str = (const char *)user_data;

	PRINTF("%s: type 0x%02x value_len %u\n", str, data->type, data->data_len);
	print_hex(data->data, data->data_len);
	PRINTF("\n");

	return true;
}

static void print_codec_cap(const struct bt_audio_codec_cap *codec_cap)
{
	PRINTF("codec id 0x%02x cid 0x%04x vid 0x%04x count %u\n", codec_cap->id, codec_cap->cid,
	       codec_cap->vid, codec_cap->data_len);

	if (codec_cap->id == BT_HCI_CODING_FORMAT_LC3) {
		bt_audio_data_parse(codec_cap->data, codec_cap->data_len, print_cb, "data");
	} else { /* If not LC3, we cannot assume it's LTV */
		PRINTF("data: ");
		print_hex(codec_cap->data, codec_cap->data_len);
		PRINTF("\n");
	}

	bt_audio_data_parse(codec_cap->meta, codec_cap->meta_len, print_cb, "meta");
}

static void stream_configured(struct bt_bap_stream *stream,
			      const struct bt_audio_codec_qos_pref *pref)
{
	PRINTF("Audio Stream %p configured\n", stream);

	OSA_SemaphorePost(sem_stream_configured);
}

static void stream_qos_set(struct bt_bap_stream *stream)
{
	PRINTF("Audio Stream %p QoS set\n", stream);

	OSA_SemaphorePost(sem_stream_qos);
}

static void stream_enabled(struct bt_bap_stream *stream)
{
	PRINTF("Audio Stream %p enabled\n", stream);

	if(stream == &streams[0])
	{
		seq_num = 0;
		BOARD_SyncSignal_Start(0);
	}

	OSA_SemaphorePost(sem_stream_enabled);
}

static void stream_connected(struct bt_bap_stream *stream)
{
	PRINTF("Audio Stream %p started\n", stream);

	OSA_SemaphorePost(sem_stream_connected);
}

static void stream_started(struct bt_bap_stream *stream)
{
	PRINTF("Audio Stream %p started\n", stream);

	/* Reset sequence number for sinks */
	for (size_t i = 0U; i < CONFIG_BT_MAX_CONN; i++) {
		if (stream->ep == sinks[i].ep) {
			sinks[i].seq_num = 0U;
			break;
		}
	}

	OSA_SemaphorePost(sem_stream_started);
}

static void stream_metadata_updated(struct bt_bap_stream *stream)
{
	PRINTF("Audio Stream %p metadata updated\n", stream);
}

static void stream_disabled(struct bt_bap_stream *stream)
{
	PRINTF("Audio Stream %p disabled\n", stream);

	OSA_SemaphorePost(sem_stream_disabled);
}

static void stream_stopped(struct bt_bap_stream *stream, uint8_t reason)
{
	BOARD_SyncSignal_Stop();
	PRINTF("Audio Stream %p stopped with reason 0x%02X\n", stream, reason);
}

static void stream_released(struct bt_bap_stream *stream)
{
	PRINTF("Audio Stream %p released\n", stream);
}

static struct bt_bap_stream_ops stream_ops = {
	.configured = stream_configured,
	.qos_set = stream_qos_set,
	.enabled = stream_enabled,
	.started = stream_started,
	.metadata_updated = stream_metadata_updated,
	.disabled = stream_disabled,
	.stopped = stream_stopped,
	.released = stream_released,
	.connected = stream_connected,
};

static void add_remote_sink(struct bt_bap_ep *ep, uint8_t index)
{
	PRINTF("Sink #%u: ep %p\n", index, ep);

	if (index >= ARRAY_SIZE(sinks)) {
		PRINTF("Could not add sink ep[%u]\n", index);
		return;
	}

	sinks[index].ep = ep;
}

static void print_remote_codec_cap(const struct bt_audio_codec_cap *codec_cap,
				   enum bt_audio_dir dir)
{
	PRINTF("codec_cap %p dir 0x%02x\n", codec_cap, dir);

	print_codec_cap(codec_cap);
}

static void discover_sinks_cb(struct bt_conn *conn, int err, enum bt_audio_dir dir)
{
	if (err != 0 && err != BT_ATT_ERR_ATTRIBUTE_NOT_FOUND) {
		PRINTF("Discovery failed: %d\n", err);
		return;
	}

	if (err == BT_ATT_ERR_ATTRIBUTE_NOT_FOUND) {
		PRINTF("Discover sinks completed without finding any sink ASEs\n");
	} else {
		PRINTF("Discover sinks complete: err %d\n", err);
	}

	OSA_SemaphorePost(sem_sinks_discovered);

