solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/boards/mimxrt700evk/edgefast_bluetooth_examples/unicast_media_sender/cm33_core0/unicast_media_sender.c
}

static void connected(struct bt_conn *conn, uint8_t err)
{
	char addr[BT_ADDR_LE_STR_LEN];
	struct bt_conn_info info;

	bt_conn_get_info(conn, &info);

	if(info.type == BT_CONN_TYPE_LE)
	{

		(void)bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

		if (err != 0) {
			PRINTF("LE Failed to connect to %s (%u)\n", addr, err);

			bt_conn_unref(default_conn[default_conn_index]);
			default_conn[default_conn_index] = NULL;

			return;
		}

		if (conn != default_conn[default_conn_index]) {
			return;
		}

		PRINTF("LE Connected: %s\n", addr);

		OSA_SemaphorePost(sem_connected);
	}
}

static void disconnected(struct bt_conn *conn, uint8_t reason)
{
	char addr[BT_ADDR_LE_STR_LEN];
	int i;

	struct bt_conn_info info;

	bt_conn_get_info(conn, &info);

    	if(info.type == BT_CONN_TYPE_LE)
	{
		PRINTF("LE Disconnected: %s (reason 0x%02x)\n", addr, reason);

		for (i = 0; i < CONFIG_BT_MAX_CONN; i++)
		{
			if(conn == default_conn[i])
			{
				break;
			}
		}

		if(i >= CONFIG_BT_MAX_CONN)
		{
			return;
		}

		if (conn != default_conn[i]) {
			return;
		}

		(void)bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

		PRINTF("LE Disconnected: %s (reason 0x%02x)\n", addr, reason);

		bt_conn_unref(default_conn[i]);
		default_conn[i] = NULL;

		OSA_SemaphorePost(sem_disconnected);
	}
}

static void security_changed_cb(struct bt_conn *conn, bt_security_t level,
				enum bt_security_err err)
{
	struct bt_conn_info info;

	bt_conn_get_info(conn, &info);

    	if(info.type == BT_CONN_TYPE_LE)
	{
		if (err == 0) {
			OSA_SemaphorePost(sem_security_updated);
		} else {
			PRINTF("LE Failed to set security level: %u", err);
		}
	}
}

static struct bt_conn_cb conn_callbacks = {
    .connected = connected,
    .disconnected = disconnected,
    .security_changed = security_changed_cb
};

static void att_mtu_updated(struct bt_conn *conn, uint16_t tx, uint16_t rx)
{
	PRINTF("MTU exchanged: %u/%u\n", tx, rx);
	OSA_SemaphorePost(sem_mtu_exchanged);
}

static struct bt_gatt_cb gatt_callbacks = {
	.att_mtu_updated = att_mtu_updated,
};

static void unicast_client_location_cb(struct bt_conn *conn,
				      enum bt_audio_dir dir,
				      enum bt_audio_location loc)
{
	PRINTF("dir %u loc %X\n", dir, loc);

	for(int index = 0; index < CONFIG_BT_MAX_CONN; index++)
	{
		if(conn == default_conn[index])
		{
			audio_receiver_loc[index] = loc;
			break;
		}
	}
}

static void available_contexts_cb(struct bt_conn *conn,
				  enum bt_audio_context snk_ctx,
				  enum bt_audio_context src_ctx)
{
	PRINTF("snk ctx %u src ctx %u\n", snk_ctx, src_ctx);
}

static void pac_record_cb(struct bt_conn *conn, enum bt_audio_dir dir,
			  const struct bt_audio_codec_cap *codec_cap)
{
	print_remote_codec_cap(codec_cap, dir);
}

static void endpoint_cb(struct bt_conn *conn, enum bt_audio_dir dir, struct bt_bap_ep *ep)
{
	int index;

	for(index = 0; index < CONFIG_BT_MAX_CONN; index++)
	{
		if(conn == default_conn[index])
		{
			break;
		}
	}

	if (dir == BT_AUDIO_DIR_SINK) {
		add_remote_sink(ep, index);
	}
}

static struct bt_bap_unicast_client_cb unicast_client_cbs = {
	.location = unicast_client_location_cb,
	.available_contexts = available_contexts_cb,
	.pac_record = pac_record_cb,
	.endpoint = endpoint_cb,
};

static int init(void)
{
	(void)OSA_SemaphoreCreate(sem_wav_opened, 0);
	(void)OSA_SemaphoreCreate(sem_lc3_preset, 0);
	(void)OSA_SemaphoreCreate(sem_scan, 0);
	(void)OSA_SemaphoreCreate(sem_device_selected, 0);
	(void)OSA_SemaphoreCreate(sem_connected, 0);
	(void)OSA_SemaphoreCreate(sem_csip_discovered, 0);
	(void)OSA_SemaphoreCreate(sem_member_discovered, 0);
	(void)OSA_SemaphoreCreate(sem_disconnected, 0);
	(void)OSA_SemaphoreCreate(sem_mtu_exchanged, 0);
	(void)OSA_SemaphoreCreate(sem_security_updated, 0);
	(void)OSA_SemaphoreCreate(sem_sinks_discovered, 0);
	(void)OSA_SemaphoreCreate(sem_vcs_discovered, 0);
	(void)OSA_SemaphoreCreate(sem_sources_discovered, 0);
	(void)OSA_SemaphoreCreate(sem_stream_configured, 0);
	(void)OSA_SemaphoreCreate(sem_stream_qos, 0);
	(void)OSA_SemaphoreCreate(sem_stream_enabled, 0);
	(void)OSA_SemaphoreCreate(sem_stream_disabled, 0);
	(void)OSA_SemaphoreCreate(sem_stream_started, 0);
	(void)OSA_SemaphoreCreate(sem_stream_connected, 0);

#if defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
#else
	int err = bt_enable(NULL);
	if (err != 0) {
		PRINTF("Bluetooth enable failed (err %d)\n", err);
		return err;
	}
#endif

	bt_conn_cb_register(&conn_callbacks);

	for (size_t i = 0; i < ARRAY_SIZE(streams); i++) {
		streams[i].ops = &stream_ops;
	}

	bt_gatt_cb_register(&gatt_callbacks);

	return 0;
}

static bool get_advertise_data(struct net_buf_simple *ad, uint8_t type, struct bt_data *ad_data)
{
	bool found = false;
	struct net_buf_simple_state state;

	net_buf_simple_save(ad, &state);

	while(ad->len > 1)
	{
		uint8_t len = net_buf_simple_pull_u8(ad);
		if (len == 0U) {
			/* Early termination */
			break;
		}

		if (len > ad->len) {
			/* malformed advertising data */
			break;
		}

		uint8_t ad_type = net_buf_simple_pull_u8(ad);
		if(ad_type == type)
		{
			if(ad_data)
			{
				ad_data->type = type;
				ad_data->data_len = len - 1;
				ad_data->data = ad->data;
			}
			found = true;
			break;
		}

		net_buf_simple_pull(ad, len - 1);
	}

	net_buf_simple_restore(ad, &state);

	return found;
}

static void scan_cb(const bt_addr_le_t *addr, int8_t rssi, uint8_t adv_type, struct net_buf_simple *ad)
{
	struct bt_data ad_data;
	char addr_str[BT_ADDR_LE_STR_LEN];
	char device_name[32];

	/* Resolvable Set Identifier */
	if(!get_advertise_data(ad, BT_DATA_CSIS_RSI, NULL))
	{
		return;
	}

	if(rssi < -70)
	{
		return;
	}

	/* skip the addr in the list. */
	for(int i = 0; i < devices_list_count; i++)
	{
		if(0 == memcmp(addr, &devices_list[i], sizeof(bt_addr_le_t)))
		{
			return;
		}
	}

