solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/boards/mimxrt700evk/edgefast_bluetooth_examples/unicast_media_sender/cm33_core0/unicast_media_sender.c
	/* save the addr */
	if (devices_list_count >= ARRAY_SIZE(devices_list))
	{
		return;
	}
	memcpy(&devices_list[devices_list_count], addr, sizeof(bt_addr_le_t));
	devices_list_count += 1;

	/* print the device info */
	(void)bt_addr_le_to_str(addr, addr_str, sizeof(addr_str));
	memset(device_name, 0, sizeof(device_name));
	if(get_advertise_data(ad, BT_DATA_NAME_COMPLETE, &ad_data))
	{
		memcpy(device_name, ad_data.data, (ad_data.data_len < sizeof(device_name)) ? ad_data.data_len : (sizeof(device_name) - 1));
	}
	PRINTF("[%d]: %s, rssi %d, %s\n", devices_list_count - 1, addr_str, rssi, device_name);
}

int device_scan(void)
{
	int err;

	/* This demo doesn't require active scan */
	err = bt_le_scan_start(BT_LE_SCAN_PASSIVE, scan_cb);
	if(err)
	{
		if(err == -EALREADY) {
			PRINTF("Scan already started!\n");
		}
		else
		{
			PRINTF("Scan failed to start (err %d)\n", err);
			return -1;
		}
	}

	return 0;
}

int device_select(int index)
{
	if(!IN_RANGE(index, 0, devices_list_count))
	{
		PRINTF("index should in range [0, %d]\n", devices_list_count - 1);
		return -1;
	}

	memcpy(&target_devices[0], &devices_list[index], sizeof(bt_addr_le_t));

	int err = bt_le_scan_stop();
	if(err)
	{
		PRINTF("scan stop fail with err %d\n", err);
	}

	(void)OSA_SemaphorePost(sem_device_selected);

	return 0;
}

static void member_scan_cb(const bt_addr_le_t *addr, int8_t rssi, uint8_t adv_type, struct net_buf_simple *ad)
{
	struct bt_data ad_data;
	char addr_str[BT_ADDR_LE_STR_LEN];
	char device_name[32];

	if(rssi < -70)
	{
		return;
	}

	/* Resolvable Set Identifier */
	if(!get_advertise_data(ad, BT_DATA_CSIS_RSI, &ad_data))
	{
		return;
	}

	if(!bt_csip_set_coordinator_is_set_member(sirk, &ad_data))
	{
		return;
	}

	/* save the addr */
	memcpy(&target_devices[1], addr, sizeof(bt_addr_le_t));

	/* print the device info */
	(void)bt_addr_le_to_str(addr, addr_str, sizeof(addr_str));
	memset(device_name, 0, sizeof(device_name));
	if(get_advertise_data(ad, BT_DATA_NAME_COMPLETE, &ad_data))
	{
		memcpy(device_name, ad_data.data, (ad_data.data_len < sizeof(device_name)) ? ad_data.data_len : (sizeof(device_name) - 1));
	}
	PRINTF("member: %s, rssi %d, %s\n", addr_str, rssi, device_name);

	int err = bt_le_scan_stop();
	if(err)
	{
		PRINTF("scan stop fail with err %d\n", err);
	}

	(void)OSA_SemaphorePost(sem_member_discovered);
}

static int member_scan(void)
{
	int err;

	/* This demo doesn't require active scan */
	err = bt_le_scan_start(BT_LE_SCAN_PASSIVE, member_scan_cb);
	if(err)
	{
		if(err == -EALREADY) {
			PRINTF("Scan already started!\n");
		}
		else
		{
			PRINTF("Scan failed to start (err %d)\n", err);
			return -1;
		}
	}

	return 0;
}

static int device_connect(int index)
{
	int err;

	if(index == 0)
	{
		PRINTF("Connect first device\n");
		default_conn_index = 0;
	}
	if(index == 1)
	{
		PRINTF("Connect second device\n");
		default_conn_index = 1;
	}

	err = bt_conn_le_create(&target_devices[default_conn_index], BT_CONN_LE_CREATE_CONN,
		&conn_param,
		&default_conn[default_conn_index]);
	if (err != 0) {
		PRINTF("Create conn to failed (%u)\n", err);
		return err;
	}

	err = OSA_SemaphoreWait(sem_connected, osaWaitForever_c);
	if (err != 0) {
		PRINTF("failed to take sem_connected (err %d)\n", err);
		return err;
	}

	err = OSA_SemaphoreWait(sem_mtu_exchanged, osaWaitForever_c);
	if (err != 0) {
		PRINTF("failed to take sem_mtu_exchanged (err %d)\n", err);
		return err;
	}

	err = bt_conn_set_security(default_conn[index], BT_SECURITY_L2);
	if (err != 0) {
		PRINTF("failed to set security (err %d)\n", err);
	}

	err = OSA_SemaphoreWait(sem_security_updated, osaWaitForever_c);
	if (err != 0) {
		PRINTF("failed to take sem_security_updated (err %d)\n", err);
		return err;
	}

	return 0;
}

static void vcs_client_discover_callback(struct bt_conn *conn, int err)
{
	if(err)
	{
		PRINTF("VCS discover failed with %d\n", err);
		return;
	}

	(void)OSA_SemaphorePost(sem_vcs_discovered);
}

static int discover_vcs(int index)
{
	int ret;
	ret = le_audio_vcs_discover(default_conn[index], index);
	if(ret)
	{
		PRINTF("vcs discover fail %d\n", ret);
		return -1;
	}

	(void)OSA_SemaphoreWait(sem_vcs_discovered, osaWaitForever_c);

        return 0;
}

static int discover_sinks(int index)
{
	int err;

	unicast_client_cbs.discover = discover_sinks_cb;

	err = bt_bap_unicast_client_discover(default_conn[index], BT_AUDIO_DIR_SINK);
	if (err != 0) {
		PRINTF("Failed to discover sinks: %d\n", err);
		return err;
	}

	err = OSA_SemaphoreWait(sem_sinks_discovered, osaWaitForever_c);
	if (err != 0) {
		PRINTF("failed to take sem_sinks_discovered (err %d)\n", err);
		return err;
	}

	return 0;
}

static int configure_stream(struct bt_bap_stream *stream, struct bt_bap_ep *ep)
{
	int err;
	int i;
	enum bt_audio_location chan_allocation_value;

	for(i = 0; i < CONFIG_BT_MAX_CONN; i++)
	{
		if(ep == sinks[i].ep)
		{
			break;
		}
	}

	if(i >= CONFIG_BT_MAX_CONN)
	{
		return -1;
	}

	/* change channel allocation. */
	chan_allocation_value = (enum bt_audio_location)(audio_receiver_loc[i] & (BT_AUDIO_LOCATION_FRONT_LEFT | BT_AUDIO_LOCATION_FRONT_RIGHT));
	bt_audio_codec_cfg_set_chan_allocation(&lc3_preset.codec_cfg, chan_allocation_value);

	err = bt_bap_stream_config(default_conn[i], stream, ep,
					&lc3_preset.codec_cfg);
	if (err != 0) {
		return err;
	}

	err = OSA_SemaphoreWait(sem_stream_configured, osaWaitForever_c);
	if (err != 0) {
		PRINTF("failed to take sem_stream_configured (err %d)\n", err);
		return err;
	}

	return 0;
}

static int configure_streams(int index)
{
	int err;

	struct bt_bap_ep *ep = sinks[index].ep;
	struct bt_bap_stream *stream = &streams[index];

	if (ep == NULL) {
		return -1;
	}

	err = configure_stream(stream, ep);
	if (err != 0) {
		PRINTF("Could not configure sink stream[%zu]: %d\n",
				index, err);
		return err;
	}

	PRINTF("Configured sink stream[%zu]\n", index);

