solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/boards/mimxrt700evk/edgefast_bluetooth_examples/unicast_media_sender/cm33_core0/unicast_media_sender.c
	return 0;
}

static int create_group(void)
{
	const size_t params_count = CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT;
	struct bt_bap_unicast_group_stream_pair_param pair_params[CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT + CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SRC_COUNT];
	struct bt_bap_unicast_group_stream_param stream_params[CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT + CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SRC_COUNT];
	struct bt_bap_unicast_group_param param;
	int err;

	for (size_t i = 0U; i < CONFIG_BT_BAP_UNICAST_CLIENT_ASE_SNK_COUNT; i++) {
		stream_params[i].stream = &streams[i];
		stream_params[i].qos = &lc3_preset.qos;

		pair_params[i].tx_param = &stream_params[i];
		pair_params[i].rx_param = NULL;
	}

	param.params = pair_params;
	param.params_count = params_count;
	param.packing = iso_packing;

	err = bt_bap_unicast_group_create(&param, &unicast_group);
	if (err != 0) {
		PRINTF("Could not create unicast group (err %d)\n", err);
		return err;
	}

	return 0;
}

static int delete_group(void)
{
	int err;

	err = bt_bap_unicast_group_delete(unicast_group);
	if (err != 0) {
		PRINTF("Could not create unicast group (err %d)\n", err);
		return err;
	}

	return 0;
}

static int set_stream_qos(int index)
{
	int err;

	err = bt_bap_stream_qos(default_conn[index], unicast_group);
	if (err != 0) {
		PRINTF("Unable to setup QoS: %d\n", err);
		return err;
	}

	PRINTF("QoS: waiting for %zu streams\n", index);
	(void)OSA_SemaphoreWait(sem_stream_qos, osaWaitForever_c);

	return 0;
}

static int enable_streams(int index)
{
	int err;

	err = bt_bap_stream_enable(&streams[index],
						lc3_preset.codec_cfg.meta,
						lc3_preset.codec_cfg.meta_len);
	if (err != 0) {
		PRINTF("Unable to enable stream: %d\n", err);
		return err;
	}

	err = OSA_SemaphoreWait(sem_stream_enabled, osaWaitForever_c);
	if (err != 0) {
		PRINTF("failed to take sem_stream_enabled (err %d)\n", err);
		return err;
	}

	return 0;
}

static int disable_streams(int index)
{
	int err;

	err = bt_bap_stream_disable(&streams[index]);
	if (err != 0) {
		PRINTF("Unable to enable stream: %d\n", err);
		return err;
	}

	err = OSA_SemaphoreWait(sem_stream_disabled, osaWaitForever_c);
	if (err != 0) {
		PRINTF("failed to take sem_stream_disabled (err %d)\n", err);
		return err;
	}

	return 0;
}

static int connect_streams(int index)
{
	int err;

	err = bt_bap_stream_connect(&streams[index]);
	if (err != 0) {
		PRINTF("Unable to start stream: %d\n", err);
		return err;
	}

	err = OSA_SemaphoreWait(sem_stream_connected, osaWaitForever_c);
	if (err != 0) {
		PRINTF("failed to take sem_stream_connected (err %d)\n", err);
		return err;
	}

	return 0;
}

static int start_streams(int index)
{
	int err;

	err = OSA_SemaphoreWait(sem_stream_started, osaWaitForever_c);
	if (err != 0) {
		PRINTF("failed to take sem_stream_started (err %d)\n", err);
		return err;
	}

	return 0;
}

static void reset_data(void)
{
	(void)OSA_SemaphoreDestroy(sem_wav_opened);
	(void)OSA_SemaphoreDestroy(sem_lc3_preset);
	(void)OSA_SemaphoreDestroy(sem_scan);
	(void)OSA_SemaphoreDestroy(sem_device_selected);
	(void)OSA_SemaphoreDestroy(sem_connected);
	(void)OSA_SemaphoreDestroy(sem_csip_discovered);
	(void)OSA_SemaphoreDestroy(sem_member_discovered);
	(void)OSA_SemaphoreDestroy(sem_disconnected);
	(void)OSA_SemaphoreDestroy(sem_mtu_exchanged);
	(void)OSA_SemaphoreDestroy(sem_security_updated);
	(void)OSA_SemaphoreDestroy(sem_sinks_discovered);
	(void)OSA_SemaphoreDestroy(sem_vcs_discovered);
	(void)OSA_SemaphoreDestroy(sem_sources_discovered);
	(void)OSA_SemaphoreDestroy(sem_stream_configured);
	(void)OSA_SemaphoreDestroy(sem_stream_qos);
	(void)OSA_SemaphoreDestroy(sem_stream_enabled);
	(void)OSA_SemaphoreDestroy(sem_stream_disabled);
	(void)OSA_SemaphoreDestroy(sem_stream_started);
	(void)OSA_SemaphoreDestroy(sem_stream_connected);

	(void)OSA_SemaphoreCreate(sem_wav_opened, 0);
	(void)OSA_SemaphoreCreate(sem_lc3_preset, 0);
	(void)OSA_SemaphoreCreate(sem_scan, 0);
	(void)OSA_SemaphoreCreate(sem_device_selected, 0);
	(void)OSA_SemaphoreCreate(sem_connected, 0);
	(void)OSA_SemaphoreCreate(sem_csip_discovered, 0);
	(void)OSA_SemaphoreCreate(sem_member_discovered, 0);
	(void)OSA_SemaphoreCreate(sem_disconnected, 0);
	(void)OSA_SemaphoreCreate(sem_mtu_exchanged, 0);
	(void)OSA_SemaphoreCreate(sem_security_updated, 0);
	(void)OSA_SemaphoreCreate(sem_sinks_discovered, 0);
	(void)OSA_SemaphoreCreate(sem_vcs_discovered, 0);
	(void)OSA_SemaphoreCreate(sem_sources_discovered, 0);
	(void)OSA_SemaphoreCreate(sem_stream_configured, 0);
	(void)OSA_SemaphoreCreate(sem_stream_qos, 0);
	(void)OSA_SemaphoreCreate(sem_stream_enabled, 0);
	(void)OSA_SemaphoreCreate(sem_stream_disabled, 0);
	(void)OSA_SemaphoreCreate(sem_stream_started, 0);
	(void)OSA_SemaphoreCreate(sem_stream_connected, 0);

	memset(sinks, 0, sizeof(sinks));
}

void mcs_server_state_cb(int state)
{
	if(state == MCS_SERVER_STATE_PLAYING)
	{
		PRINTF("\nMCS server state: playing\n");
		if(cis_stream_play)
		{
			return;
		}

		cis_stream_play_update = true;
		cis_stream_play = true;
	}

	if(state == MCS_SERVER_STATE_PAUSED)
	{
		PRINTF("\nMCS server state: pause\n");
		if(!cis_stream_play)
		{
			return;
		}

		cis_stream_play_update = true;
		cis_stream_play = false;
	}
}

static void csip_set_coordinator_discover_cb(
	struct bt_conn *conn,
	const struct bt_csip_set_coordinator_set_member *member,
	int err, size_t set_count)
{
	if(err) {
		PRINTF("CSIP conn %p csip discover err %d\n", conn, err);
	}
	else {
		PRINTF("CSIP conn %p discovered set count %d\n", conn, set_count);
		for(int i = 0; i < set_count; i++)
		{
			const struct bt_csip_set_coordinator_set_info *info = &member->insts[i].info;
			PRINTF("set %d/%d info:\n", i+1, set_count);
			PRINTF("\tsirk: ");
			for(int j = 0; j < BT_CSIP_SIRK_SIZE; j++)
			{
				PRINTF("%02x ", info->sirk[j]);
			}
			PRINTF("\n");

			PRINTF("\tset_size: %d\n", info->set_size);

			PRINTF("\trank: %d\n", info->rank);

			PRINTF("\tlockable: %d\n", info->lockable);

			if(!set_sirk_set)
			{
				set_sirk_set = true;
				memcpy(&sirk, &info->sirk[i], BT_CSIP_SIRK_SIZE);
			}
		}
	}
	(void)OSA_SemaphorePost(sem_csip_discovered);
}

