solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/boards/mimxrt700evk/edgefast_bluetooth_examples/unicast_media_sender/cm33_core0/unicast_media_sender.c
static struct bt_csip_set_coordinator_cb csip_cb = {
	.discover = csip_set_coordinator_discover_cb
};

void unicast_media_sender_task(void *param)
{
	int err;

	/* shell init. */
	le_audio_shell_init();

	PRINTF("Initializing\n");
	err = init();
	if (err != 0) {
		while(1);
	}
	PRINTF("Initialized\n");

	/* VCS */
	le_audio_vcs_client_init(vcs_client_discover_callback);

	/* MCS */
	le_audio_mcs_server_init(mcs_server_state_cb);

	/* CSIP */
	err = bt_csip_set_coordinator_register_cb(&csip_cb);
	if (err != 0) {
		PRINTF("Failed to register csip callbacks: %d", err);
		while(1);
	}

#if defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
#else
	/* Host msd init. */
#if (defined(BT_BLE_PLATFORM_INIT_ESCAPE) && (BT_BLE_PLATFORM_INIT_ESCAPE > 0))
	USB_HostMsdFatfsInit();
	PRINTF("FatFs initialized\n");
#endif
	/* List wav file in the root dir. */
	wav_file_list("1:/");
	/* Open wav file */
	PRINTF("\nPlease open the wav file you want use \"wav_open <path>\" command.\n");
	OSA_SemaphoreWait(sem_wav_opened, osaWaitForever_c);
#endif
	/* Select LC3 preset */
#if defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
#if defined(APP_BRIDGE_UPSAMPLE_441_TO_48) && (APP_BRIDGE_UPSAMPLE_441_TO_48 > 0)
	print_all_preset(48000);
#else
	print_all_preset(a2dp_audio_sample_rate);
#endif
#else
	print_all_preset(wav_file.sample_rate);
#endif
	PRINTF("\nPlease select lc3 preset use \"lc3_preset <name>\" command.\n");
	OSA_SemaphoreWait(sem_lc3_preset, osaWaitForever_c);
	/* Config audio parameters. */
#if defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
#if defined(APP_BRIDGE_UPSAMPLE_441_TO_48) && (APP_BRIDGE_UPSAMPLE_441_TO_48 > 0)
	config_audio_parameters(48000, a2dp_audio_channels, a2dp_audio_bits);
#else
	config_audio_parameters(a2dp_audio_sample_rate, a2dp_audio_channels, a2dp_audio_bits);
#endif
#else
	config_audio_parameters(wav_file.sample_rate, wav_file.channels, wav_file.bits);
#endif
	/* overlay rtn & pd if set */
	if(new_rtn >= 0)
	{
		lc3_preset.qos.rtn = new_rtn;
	}
	if(new_pd >= 0)
	{
		lc3_preset.qos.pd = new_pd;
	}
	if(new_phy > 0)
	{
		lc3_preset.qos.phy = new_phy;
	}

	if((new_rtn >= 0) || (new_pd >= 0) || (new_phy > 0))
	{
		print_lc3_preset("new_preset", &lc3_preset);
	}

	err = bt_bap_unicast_client_register_cb(&unicast_client_cbs);
	if (err != 0) {
		PRINTF("Failed to register client callbacks: %d", err);
		while(1);
	}

	while (true) {
		reset_data();

		PRINTF("Creating unicast group\n");
		err = create_group();
		if (err != 0) {
			break;
		}
		PRINTF("Unicast group created\n");

		PRINTF("Please scan and connect the devices you want!\n");
		err = OSA_SemaphoreWait(sem_scan, osaWaitForever_c);
		if (err != 0) {
			PRINTF("failed to take sem_scan (err %d)\n", err);
			break;
		}

		err = device_scan();
		if (err != 0) {
			PRINTF("device scan err %d\n", err);
			break;
		}
		PRINTF("Scanning successfully started\n");

		err = OSA_SemaphoreWait(sem_device_selected, osaWaitForever_c);
		if (err != 0) {
			PRINTF("failed to take sem_device_selected (err %d)\n", err);
			break;
		}
		PRINTF("device selected!\n");

		for (int i = 0; i < LE_CONN_COUNT; i++)
		{
			PRINTF("Connecting\n");
			err = device_connect(i);
			if (err != 0) {
				break;
			}
			PRINTF("Connected\n");

			PRINTF("CSIP discover\n");
			err = bt_csip_set_coordinator_discover(default_conn[i]);
			if (err != 0) {
				PRINTF("CSIP set coordinator discover err %d\n", err);
				break;
			}
			OSA_SemaphoreWait(sem_csip_discovered, osaWaitForever_c);
			PRINTF("CSIP discovered\n");

			if(i == 0)
			{
				PRINTF("Scan another member\n");

				member_scan();

				OSA_SemaphoreWait(sem_member_discovered, osaWaitForever_c);
				PRINTF("Member discovered\n");
			}
		}

		for (int i = 0; i < LE_CONN_COUNT; i++)
		{
			PRINTF("Discover VCS\n");
			err = discover_vcs(i);
			if(err)
			{
				PRINTF("discover vcs %d failed, error %d\n", i, err);
			}
			PRINTF("Discover VCS complete.\n");

			PRINTF("Discovering sinks\n");
			err = discover_sinks(i);
			if (err != 0) {
				break;
			}
			PRINTF("Sinks discovered\n");

			PRINTF("Configuring streams\n");
			err = configure_streams(i);
			if (err != 0) {
				break;
			}
			PRINTF("Stream configured\n");

			PRINTF("Setting stream QoS\n");
			err = set_stream_qos(i);
			if (err != 0) {
				break;
			}
			PRINTF("Stream QoS Set\n");

			PRINTF("Enabling streams\n");
			err = enable_streams(i);
			if (err != 0) {
				break;
			}
			PRINTF("Streams enabled\n");

			PRINTF("Connecting streams\n");
			err = connect_streams(i);
			if (err != 0) {
				break;
			}
			PRINTF("Streams connected\n");

			PRINTF("Starting streams\n");
			err = start_streams(i);
			if (err != 0) {
				break;
			}
			PRINTF("Streams started\n");
		}

		int res = 0;
		do{
			if (cis_stream_play)
			{
				if(cis_stream_play_update)
				{
					cis_stream_play_update = false;
					for(int i = 0; i < LE_CONN_COUNT; i++)
					{
						err = enable_streams(i);
						if(err)
						{
							PRINTF("\nEnable stream %d err %d\n", i, err);
						}

						err = connect_streams(i);
						if (err) {
							PRINTF("\nConnect stream %d err %d\n", i, err);
						}

						err = start_streams(i);
						if(err)
						{
							PRINTF("\nStart stream %d err %d\n", i, err);
						}
					}
				}
				res = audio_stream_encode(false);
			}
			else
			{
				if(cis_stream_play_update)
				{
					cis_stream_play_update = false;

					/* send 2 mute frames to sink to avoid LC3 PLC noise. */
					(void)audio_stream_encode(true);
					(void)audio_stream_encode(true);

#if 1				/* MCUX-62728: walkaround to disconnect 2rd CIS first for controller fw limitation. */
					for(int i = 1; i >= 0; i--)
#else
					for(int i = 0; i < CONFIG_BT_MAX_CONN; i++)
#endif
					{
						err = disable_streams(i);
						if(err)
						{
							PRINTF("\nDisable stream %d err %d\n", i, err);
						}
					}
				}
				OSA_TimeDelay(2);
			}
		} while (0 == res);

		/* Wait for disconnect */
		err = OSA_SemaphoreWait(sem_disconnected, osaWaitForever_c);
		if (err != 0) {
			PRINTF("failed to take sem_disconnected (err %d)\n", err);
			break;
		}

		PRINTF("Deleting group\n");
		err = delete_group();
		if (err != 0) {
			break;
		}
		PRINTF("Group deleted\n");
	}

#if defined(CONFIG_BT_A2DP_SINK) && (CONFIG_BT_A2DP_SINK > 0)
#else
	close_wav_file();
#endif

	while(1);
}
